using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace program_27
{   //题目要求当n取值连续0,1,2....t时(n*n+a*n+b)得到素数,这个连续值最大t能够达到多少.此时的a和b为何值,三次循环问题,简单编程后发现运行时间可能数十分钟
    //*****************************************   时间优化    ********************************
    //n=0时,公式=b得到素数,所以b为素数
    //n=1时,公式=1+b+a为素数,a需要为奇数,且a+b+1>1可以通过b确定a的取值
    //i在循环到n之前一旦产生非素数立即break,避免多余循环
    //暂时把三个变量尽量优化了,时间也可以接受,就不进行更多的优化了
    //****************************经过简单优化将程序运行时间缩减为1min左右********************
    //*********运行结果为 连续71个素数,此时公式为 n²-61n+971 a*b=-59231***********************
    class Program
    {

        public static bool Primes(int x)
        {
            if (x < 0) { return false; }
            for (int m = 2; m * m <=x; m++)
            {
                if (x % m == 0)
                {
                    return false ;
                }
               
            }
           
            return true;      
        }
        //1000以内素数,便于时间优化
        static int[] B=new int[]{2 ,3 ,5, 7 ,11 ,13 ,17 ,19 ,23 ,29, 31, 37, 41 ,43 ,47 ,53, 59 ,61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109 ,113, 127, 131, 137, 139 ,149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241 ,251 ,257 ,263, 269 ,271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389 ,397 ,401 ,409, 419, 421, 431, 433, 439, 443, 449 ,457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569 ,571 ,577 ,587 ,593 ,599, 601, 607, 613, 617, 619 ,631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 821, 823, 827, 829, 839, 853, 857 ,859 ,863 ,877 ,881, 883, 887, 907, 911, 919 ,929, 937 ,941 ,947 ,953 ,967 ,971 ,977, 983, 991, 997};


        public static void Formula(int absolute) 
        {
            int sum=0;
            int ix = 0;
            int ax = 0;
            int bx = 0;      
            foreach (int b in B)
            {
                for (int a = absolute; a >-b; a = a - 2)
                    {
                        for (int i = 0; i <= absolute; i++)
                        {
                            sum = i * i + a * i + b;
                            Console.WriteLine(i);
                            if (Primes(sum) == false)
                            {

                                if (i > ix)
                                {
                                    ax = a;
                                    bx = b;
                                    ix = i;
                                }
                                break ;
                            }
                        }
                    }
                }
            Console.WriteLine("最大连续素数值为" + ix+"个,此时公式为n²+" + ax + "n+" + bx + ";a*b=" + ax * bx);
        }
        static void Main(string[] args)
        {
             Formula(999) ;
             Console.ReadLine();


        }
    }
}
